---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctSizes
source: html/a9dcbad0-c064-9e37-a1d2-22b50a31faba.htm
---
# DuctSizes Members

Checks whether a duct size with the nominal diameter exists.